In [3]:
print("Week 3 Day 2")

Week 3 Day 2

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv("/home/nak/Data-Science-Course-IBA/data/new_movies_data.csv")

df.head()

,Movie_ID,Title,Release_Year,Genre,Director,Box_Office,IMDB_Rating,Duration_Minutes
0,4101,Winter's End,2001,Action,Greta Gerwig,1.868940e+09,8.1,145
1,4102,Winter's End,2007,Drama,Christopher Nolan,1.173196e+09,7.9,150
2,4103,Final Battle,2005,Romance,Wes Anderson,1.400355e+09,6.5,122
3,4104,Nightfall,1981,Drama,Steven Spielberg,1.212908e+09,8.2,191
4,4105,The Lost City,2002,Comedy,Christopher Nolan,5.033625e+08,3.8,96

In [6]:
df.groupby("Genre")["IMDB_Rating"].mean()

Genre
Action       6.181250
Adventure    6.115789
Comedy       5.605556
Drama        6.269231
Horror       6.360000
Romance      7.142105
Sci-Fi       5.470588
Thriller     6.026667
Name: IMDB_Rating, dtype: float64

In [7]:
sorted = df.sort_values(by='Duration_Minutes')
sorted.head()

,Movie_ID,Title,Release_Year,Genre,Director,Box_Office,IMDB_Rating,Duration_Minutes
104,4205,The Lost City,1977,Adventure,James Cameron,1.329075e+09,2.0,80
8,4109,Silent Echo,1985,Adventure,Christopher Nolan,1.102341e+09,4.5,82
144,4245,Into the Wild,1992,Horror,Steven Spielberg,7.977060e+08,8.4,82
78,4179,The Lost City,1998,Action,Greta Gerwig,8.012819e+08,9.2,84
111,4212,Nightfall,1982,Sci-Fi,Steven Spielberg,6.511776e+08,4.3,85

In [8]:
df.IMDB_Rating.mean()

np.float64(6.168666666666667)

In [45]:
import pandas as pd

df1 = pd.DataFrame({
    "Name": ["Ahsan", "Nadir", "Abbas", "Bilal"],
    "Score": [40, 50, 70, 80]
})

df2 = pd.DataFrame({
    "Name": ['Basit', 'Nadir', 'Raheem', 'Abbas'],
    "Score": [30, 40, 60, 70]
})

concat_df = pd.concat([df1, df2], axis=0, ignore_index=True)
concat_df

     Name  Score
0   Ahsan     40
1   Nadir     50
2   Abbas     70
3   Bilal     80
4   Basit     30
5   Nadir     40
6  Raheem     60
7   Abbas     70

In [46]:
merged = pd.merge(df1, df2, on='Name')
merged

    Name  Score_x  Score_y
0  Nadir       50       40
1  Abbas       70       70

In [105]:
import numpy as np
age = np.random.randint(20, 25, size=5)
age

array([22, 21, 24, 22, 22])

In [106]:
df3 = pd.DataFrame({
    "Name": ["Ahsan", "Nadir", "Abbas", "Bilal"],
    "Age": [30, 22, 25, 1000]
})

In [104]:
q1 = df3.Age.quantile(0.25)
q3 = df3.Age.quantile(0.75)

iqr = q3 - q1
iqr

# Lower and upper bounds
lower_bound = q1 - 1.5 * iqr
upper_bound = q3 + 1.5 * iqr

# Outliers
outliers = df3[(df3.Age < lower_bound) | (df3.Age > upper_bound)]
outliers

    Name      Age
3  Bilal  644.875